/*
    --Loop--
    while( เงื่อนไข ){
        คําสั่ง..
    }
    ++++++++++++++++++\
    do{
        คําสั่ง
    }while( เงื่อนไข )
    ++++++++++++++++++
    for(ตัวแปรพร้อมคำเริ่ม ; เงื่อนไข ; การเพิ่ม/ลดค่าตัวแปร){
    }
    */

    
#include <stdio.h>  
int main(){
    int i ;

    for(i=0; i<10; i++){
        printf("%d - Hello...", i);
    }
    printf("\n-----------------------------\n");
    i = 1;
    while(i<= 5){
        printf("%d - Hi...", i);
        i++;
    }
    printf("\n-----------------------------\n");
    i = 1;
    do{
        printf("%d - Hey...", i);
        i++;
    }while(i<= 5);

}